app/views/ct/cuentas/_form.html.erb

    <%= form.label :cliente_id %>
    <%= form.collection_select(:cliente_id, Ct::Cliente.all, :id, :nombre, options = {}, {:class => "select"})%>
---
SELECT `ct_clientes`.* FROM `ct_clientes`