app/controllers/ct/clientes_controller.rb

SELECT `ct_clientes`.* FROM `ct_clientes`
---
  def index
    @ct_clientes = Ct::Cliente.all

INSERT INTO `ct_clientes` (`nombre`, `telefono`, `direccion`, `created_at`, `updated_at`) VALUES ('jesus perez angeles', '4191564148', 'Colón,Qro', '2019-06-25 05:00:51', '2019-06-25 05:00:51')
---
  def create
    @ct_cliente = Ct::Cliente.new(ct_cliente_params)

    respond_to do |format|
      if @ct_cliente.save

UPDATE `ct_clientes` SET `direccion` = 'Tepetate,Soriano,colon,Qro.', `updated_at` = '2019-08-19 01:26:13' WHERE `ct_clientes`.`id` = 2
---
  def update
    respond_to do |format|
      if @ct_cliente.update(ct_cliente_params)

DELETE FROM `ct_clientes` WHERE `ct_clientes`.`id` = 3
---
  def destroy
    @ct_cliente.destroy

SELECT  `ct_clientes`.* FROM `ct_clientes` WHERE `ct_clientes`.`id` = 3 LIMIT 1
---
    def set_ct_cliente
      @ct_cliente = Ct::Cliente.find(params[:id])