app/controllers/ct/cuentas_controller.rb

  def index
    @ct_cuentas = Ct::Cuenta.all
---
SELECT `ct_cuentas`.* FROM `ct_cuentas`

  def create
    @ct_cuenta = Ct::Cuenta.new(ct_cuenta_params)

    respond_to do |format|
      if @ct_cuenta.save
---
INSERT INTO `ct_cuentas` (`cliente_id`, `fecha`, `activo`, `created_at`, `updated_at`) VALUES (1, '2019-09-29 02:54:00', 1, '2019-09-29 02:54:29', '2019-09-29 02:54:29')

  def update
    respond_to do |format|
      if @ct_cuenta.update(ct_cuenta_params)
---
UPDATE `ct_cuentas` SET `activo` = 1, `updated_at` = '2019-09-29 04:09:49' WHERE `ct_cuentas`.`id` = 5

  def destroy
    @ct_cuenta.destroy
---
DELETE FROM `ct_cuentas` WHERE `ct_cuentas`.`id` = 3

    def set_ct_cuenta
      @ct_cuenta = Ct::Cuenta.find(params[:id])
---
SELECT  `ct_cuentas`.* FROM `ct_cuentas` WHERE `ct_cuentas`.`id` = 5 LIMIT 1