app/controllers/ct/producto_categorias_controller.rb

  def index
    @ct_producto_categorias = Ct::ProductoCategoria.all
---
SELECT `ct_producto_categorias`.* FROM `ct_producto_categorias`

  def create
    @ct_producto_categoria = Ct::ProductoCategoria.new(ct_producto_categoria_params)

    respond_to do |format|
      if @ct_producto_categoria.save
---
INSERT INTO `ct_producto_categorias` (`categoria`, `activo`, `created_at`, `updated_at`) VALUES ('Tortilleria', 1, '2019-07-20 00:42:06', '2019-07-20 00:42:06')

    def set_ct_producto_categoria
      @ct_producto_categoria = Ct::ProductoCategoria.find(params[:id])
---
SELECT  `ct_producto_categorias`.* FROM `ct_producto_categorias` WHERE `ct_producto_categorias`.`id` = 1 LIMIT 1