app/controllers/ct/producto_catalogos_controller.rb

SELECT `ct_producto_catalogos`.* FROM `ct_producto_catalogos`
---
  def index
    @ct_producto_catalogos = Ct::ProductoCatalogo.all

INSERT INTO `ct_producto_catalogos` (`categoria_id`, `umedida_id`, `marca_id`, `barcode`, `descripcion`, `json`, `nombre`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, 1, '234', 'khfbjhfbj', 'kjbdkjd', 'tortillas', 2, '2019-07-20 00:43:55', '2019-07-20 00:43:55')
---
  def create


    @ct_producto_catalogo = current_user.Catalogos.new(ct_producto_catalogo_params)

    respond_to do |format|
      if @ct_producto_catalogo.save

DELETE FROM `ct_producto_catalogos` WHERE `ct_producto_catalogos`.`id` = 2
---
  def destroy
    @ct_producto_catalogo.destroy

SELECT  `ct_producto_catalogos`.* FROM `ct_producto_catalogos` WHERE `ct_producto_catalogos`.`id` = 5 LIMIT 1
---
    def set_ct_producto_catalogo
      @ct_producto_catalogo = Ct::ProductoCatalogo.find(params[:id])