app/controllers/ct/producto_umedidas_controller.rb

  def index
    @ct_producto_umedidas = Ct::ProductoUmedida.all
---
SELECT `ct_producto_umedidas`.* FROM `ct_producto_umedidas`

  def create
    @ct_producto_umedida = Ct::ProductoUmedida.new(ct_producto_umedida_params)

    respond_to do |format|
      if @ct_producto_umedida.save
---
INSERT INTO `ct_producto_umedidas` (`medida`, `activo`, `created_at`, `updated_at`) VALUES ('kg', 1, '2019-07-20 00:42:30', '2019-07-20 00:42:30')

    def set_ct_producto_umedida
      @ct_producto_umedida = Ct::ProductoUmedida.find(params[:id])
---
SELECT  `ct_producto_umedidas`.* FROM `ct_producto_umedidas` WHERE `ct_producto_umedidas`.`id` = 1 LIMIT 1