app/controllers/ct/producto_marcas_controller.rb

SELECT `ct_producto_marcas`.* FROM `ct_producto_marcas`
---
  def index
    @ct_producto_marcas = Ct::ProductoMarca.all

INSERT INTO `ct_producto_marcas` (`marca`, `activo`, `created_at`, `updated_at`) VALUES ('Doña lola', 1, '2019-07-20 00:42:19', '2019-07-20 00:42:19')
---
  def create
    @ct_producto_marca = Ct::ProductoMarca.new(ct_producto_marca_params)

    respond_to do |format|
      if @ct_producto_marca.save

SELECT  `ct_producto_marcas`.* FROM `ct_producto_marcas` WHERE `ct_producto_marcas`.`id` = 1 LIMIT 1
---
    def set_ct_producto_marca
      @ct_producto_marca = Ct::ProductoMarca.find(params[:id])