app/views/ct/producto_catalogos/_form.html.erb

    <%= form.label :categoria_id %>
 <%= form.collection_select(:categoria_id, Ct::ProductoCategoria.all, :id, :categoria, options = {}, {:class => "select is-primary"})%>
---
SELECT `ct_producto_categorias`.* FROM `ct_producto_categorias`

    <%= form.label :umedida_id %>
    <%= form.collection_select(:umedida_id, Ct::ProductoUmedida.all, :id, :medida, options = {}, {:class => "select"})%>
---
SELECT `ct_producto_umedidas`.* FROM `ct_producto_umedidas`

    <%= form.label :marca_id %>
    <%= form.collection_select(:marca_id, Ct::ProductoMarca.all, :id, :marca, options = {}, {:class => "select"})%>
---
SELECT `ct_producto_marcas`.* FROM `ct_producto_marcas`