app/controllers/marcas_controller.rb

  def index
    @marcas = Marca.all
---
SELECT `marcas`.* FROM `marcas`