app/controllers/modelos_controller.rb

  def index
    @modelos = Modelo.all
---
SELECT `modelos`.* FROM `modelos`