app/controllers/tipo_equipos_controller.rb

  def index
    @tipo_equipos = TipoEquipo.all
---
SELECT `tipo_equipos`.* FROM `tipo_equipos`