app/controllers/os/orden_servicios_controller.rb

  def index
    @os_orden_servicios = Os::OrdenServicio.all
---
SELECT `os_orden_servicios`.* FROM `os_orden_servicios`